from django.core.management.base import BaseCommand
import random
from apps.nom.models import Nom

class Command(BaseCommand):
    help = "Populate the Nom model with initial data."

    def handle(self, *args, **kwargs):
        nomuud = [
            {
                "name": "А. Сандуйн жүд дэлгэр",
                "description": "Сандуйн жүд үсэг тоолон дэлгэр хурна Өвчин зовлонгоос ангижруулах, осол аваараас хамгаалах, саад хорлол бүхнийг зайлуулах, санасан хэрэг бүтээхүйд уншуулдаг тарнийн ёсны дээд ном юм.",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "А.Хуралд даган баясах",
                "description": "Хийдийн тухайн өдрийн бүх уншигдах номыг уншуулж байгаатай ижил асар их буян хураана.",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "Алтангэрэл",
                "description": "Хувь хүн, өрх гэрийн эд хөрөнгө, буян хишгийг арвижуулахад болон аливаа гарз, гал усны аюул, гай зэтгэр, өвчин зовлон зэргээс гэтэлгэхийн тухайд айлтгуулна. Насны буян арвитгах, барцад саад арилгах.",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "Арван гурван сан",
                "description": "Бузар дэв арилгаж, хийморь сэргээн, ажил үйлс бүтээхэд уншуулна.",
                "day": "Бүх өдрүүдэд",
                "price": "Сүсгээрээ"
            },
            {
                "name": "Ариун сан",
                "description": "Элдэв бузрыг арилгах, лус савдаг аргадахад уншуулна.",
                "day": "Бүх өдрүүдэд",
                "price": "Сүсгээрээ"
            },
            {
                "name": "Аян замын ерөөл",
                "description": "Аян замд барцад саадгүй байлгаж, муу зүгийн гэмийг арилган, зорьсон хэрэг бүтэмжтэй байхын тухайд уншуулна.",
                "day": "Бүх өдрүүдэд",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Ажил үйлс бүтээх",
                "description": "Санасан хэрэг сэтгэлчлэн бүтэхийн тухайд",
                "day": "Бүх өдрүүдэд",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Арилжаа наймаанд",
                "description": "Буян хишгээ дэлгэрүүлж, гарлагын үүд хаахын тухайд",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Гарзын үүд хаах",
                "description": "Гарлага бүгдийн шалтгааныг засахын тухайд",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Зүүд, совин муудахад",
                "description": "Харших шалтгааныг засахын тухайд",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Лус савдаг, газар шороонд",
                "description": "Лус, Савдагын хорлол засахын тухайд",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Малын номууд",
                "description": "Малын буян хишиг дэлгэрүүлж, өвчин зовлон холуур байлгахын тухайд",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Нүгэл хилэнц нимгэлэх",
                "description": "Дүншиг",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Орлогын үүд нээх",
                "description": "Буян хишиг арвижуулахын тухайд",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            },
            {
                "name": "б. Оюун ухаанд (Шалгалтанд)",
                "description": "Ламаадан, Жамбалсанжид, Нити, Жанцанзэмүбүнжин сан, Уманжүг, Тодовсосой, Хийморийн сан.",
                "day": "Бүх өдөр",
                "price": "Сүсгээрээ"
            }
        ]

        for item in nomuud:
            Nom.objects.create(
                ner=item["name"],
                tailbar=item["description"],
                une=random.randint(1000, 10000)
            )

        self.stdout.write(self.style.SUCCESS("Database populated successfully!"))
