JIL_CHOICES = (
    ('0', 'Хулгана'),
    ('1', 'Yхэр'),
    ('2', 'Бар'),
    ('3', 'Туулай'),
    ('4', 'Луу'),
    ('5', 'Могой'),
    ('6', 'Морь'),
    ('7', 'Хонь'),
    ('8', 'Бич'),
    ('9', 'Тахиа'),
    ('10', 'Нохой'),
    ('11', 'Гахай')
)

SUUDAL_CHOICES = (
    ('WATER', 'Ус'),
    ('WOOD', 'Мод'),
    ('WIND', 'Хий'),
    ('FIRE', 'Гал'),
    ('EARTH', 'Шороо'),
    ('METAL', 'Төмөр'),
    ('SPACE', 'Огторгуй'),
    ('MOUNTAIN', 'Уул')
)

MAH_BODI_CHOICES = (
    ('0, 1', 'Мод'),
    ('2, 3', 'Гал'),
    ('4, 5', 'Шороо'),
    ('6, 7', 'Төмөр'),
    ('8, 9', 'Ус')
)

HUIS_CHOICES = (
    ('MALE', 'Эрэгтэй'),
    ('FEMALE', 'Эмэгтэй')
)

TOLBORIIN_TOLOV_CHOICES = (
    ('PENDING', 'Төлөгдөөгүй'),
    ('SUCCESS', 'Төлөгдсөн'),
    ('CANCELED', 'Цуцлагдсан')
)